{
  "basics": {
    "name": "Moritz Tomasi",
    "label": "Full-Stack Developer",
    "email": "tomasi.moritz@gmail.com",
    "phone": "+43 650 72 72 959",
    "website": "momasi.dev",
    "summary": "A full-stack developer with strong experience in front-end and back-end development, a variety of coding languages, frameworks, and technologies. A good communicator and a team player. Always willing to face new challenges and highly self-motivated.",
    "location": {
      "address": "Lerchenfelderstrasse 129/4",
      "postalCode": "1070",
      "city": "Wien",
      "countryCode": "AT",
      "region": "Wien"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "faClass": "fab fa-linkedin",
        "username": "Moritz Tomasi",
        "url": "https://www.linkedin.com/in/moritz-tomasi-990398163/"
      },
      {
        "network": "Github",
        "faClass": "fab fa-github",
        "username": "moritztomasi",
        "url": "https://github.com/moritztomasi"
      },
      {
        "network": "Twitter",
        "faClass": "fab fa-twitter",
        "username": "@MoritzTomasi",
        "url": "https://twitter.com/MoritzTomasi"
      }
    ]
  },
  "work": [
    {
      "company": "Findheim",
      "location": "Vienna",
      "position": "Co-founder & Full-Stack Developer",
      "website": "http://findheim.at",
      "startDate": "Jul. 2018",
      "endDate": "Currently",
      "summary": "In 2018 I co-founded Findheim, a real-estate matching platform for properties to buy in Vienna. While my focus laid on the conceptualization, implementation and maintenance of back-end services, I also developed front-end features for users and internal tools:",
      "highlights": [
        "Back-end stack: NodeJS, Typescript, Python, PostgreSQL, Elasticsearch, Redis.",
        "Front-end stack: HTML, CSS, TailwindCSS, Javascript, VueJS (NuxtJS), StimulusJS, Turbolinks, PugJS.",
        "Conceptualization of a data pipeline for real-estate data that would process 80,000+ real-estate ads per day.",
        "Conceptualization, implementation and maintenance of a data extraction service in a web-crawler that would extract data from crawled real-estate pages. Implemented using Python, Scrapy and semantic text analysis.",
        "Conceptualization, implementation and maintenance of a geocoding service using TomTom Multinet data, NodeJS, Typescript, PostgreSQL and PostGIS.",
        "Conceptualization, implementation and maintenance of a real-estate recommender system built with Elasticsearch.",
        "Helped create and implement code quality standards by introducing code review processes, refactoring processes and code metrics.",
        "Lead technical product management and implemented a product management process based on Basecamps book \"Shape Up\". Setup, managed and maintained planning tools like Trello and Notion.",
        "Worked with freelancers on the implementation of mobile apps (iOS, Android)."
      ]
    },
    {
      "company": "Zoomsquare",
      "location": "Vienna",
      "position": "Full-Stack Developer",
      "startDate": "Nov. 2015",
      "endDate": "Jul. 2018",
      "summary": "I worked as a full-time employee in a team of eight developers, focusing on both front-end and back-end:",
      "highlights": [
        "Back-end stack: NodeJS, Coffeescript, Typescript, Python, Java, PostgreSQL, MongoDB, Elasticsearch, Redis.",
        "Front-end stack: HTML, CSS, Bootstrap, Javascript, Angular.",
        "Developed and maintained RESTful APIs in both NodeJS (ExpressJS) and Python (Django, Tornado), that delivered and processed data from Elasticsearch and PostgreSQL.",
        "Conceptualized, implemented and maintained an image-caching service for large amounts of data.",
        "Developed an image-matching service with Python and OpenCV.",
        "Worked on user-facing front-end features and internal tooling with Angular and Bootstrap. Strong focus on mobile responsiveness and user experience.",
        "Developed various metrics with Prometheus, Grafana and Kibana."
      ]
    }
  ],
  "education": [
    {
      "institution": "Technical University of Vienna",
      "area": "Computer Science and Visual Computing",
      "studyType": "Bachelor",
      "startDate": "2009",
      "endDate": "2015",
      "summary": "Bachelor thesis and internship at the Institute for Interactive Media Systems on the subject \"Clickless Smartphone Text Translator and Enricher\". Developed an android app and web-service to extract, translate and enrich text from images, using Android SDK, Python and TesseractOCR."
    }
  ],
  "skills": [
    {
      "name": "NodeJS, Python"
    },
    {
      "name": "Javascript, Typescript"
    },
    {
      "name": "VueJS, NuxtJS"
    },
    {
      "name": "Elasticsearch, PostgreSQL, Redis, MongoDB"
    },
    {
      "name": "GIS (PostGIS, QGIS)"
    },
    {
      "name": "AWS (ECS, SQS), Docker, elastic.co"
    },
    {
      "name": "Machine Learning, Computer Vision"
    }
  ],
  "languages": [
    {
      "language": "German",
      "fluency": "mother tongue"
    },
    {
      "language": "English",
      "fluency": "fluent"
    },
    {
      "language": "Italian",
      "fluency": "fluent"
    }
  ]
}
